{"id":"09e33370-4c16-453b-9959-c943f281fcc8","rule_id":"145b5feb-883b-457e-93e9-b1ab1f80b83b","name":"Port Scanning Detection Rule","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":2,"updated_at":"2025-10-17T11:50:21.555Z","updated_by":"2517519628","created_at":"2025-10-17T11:26:51.143Z","created_by":"2517519628","enabled":true,"interval":"5m","from":"now-6m","to":"now","description":"Nmap scanning","tags":[],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":73,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"response_actions":[{"params":{"command":"suspend-process","comment":"","config":{"field":"","overwrite":true}},"action_type_id":".endpoint"}],"meta":{"kibana_siem_app_url":"https://my-security-project-ab9f75.kb.us-central1.gcp.elastic.cloud/app/security"},"type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"process.name : \"nmap\" OR event.action : \"exec\" AND message : \"*nmap*\"","filters":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
